posts/2018-05-07-git-svn-reference.org






#+date: <2018-05-07 00:00>
#+title: git svn workflow

Git provides an [[https://git-scm.com/docs/git-svn][svn-wrapper]],
allowing you to use git tools and keep your decentralized workflow even
when you aren't.

The following commands are effected:

| git         | git svn                       |
|-------------+-------------------------------|
| git pull    | git svn fetch git svn merge   |
| git push    | git svn dcommit               |
| git clone   | git svn clone                 |

If you are a [[https://magit.vc/][magit]] user, you can install
[[https://github.com/magit/magit-svn][magit-svn]]. To enable magit-svn
globally (magit will still work find with git repos):

#+begin_src elisp
(add-hook 'magit-mode-hook 'magit-svn-mode) 
#+end_src

To enable magit-svn on a per-repo basis:

#+begin_src bash
cd /path/to/repository git config --add
magit.extension svn
#+end_src
